jmeter/Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree/>
  </hashTree>

<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Example Thread Group" enabled="true">
  <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
  <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
    <boolProp name="LoopController.continue_forever">false</boolProp>
    <stringProp name="LoopController.loops">1</stringProp>
  </elementProp>
  <stringProp name="ThreadGroup.num_threads">100</stringProp>
  <stringProp name="ThreadGroup.ramp_time">10</stringProp>
  <longProp name="ThreadGroup.start_time">1623247465000</longProp>
  <longProp name="ThreadGroup.end_time">1623247475000</longProp>
  <boolProp name="ThreadGroup.scheduler">false</boolProp>
</ThreadGroup>
<hashTree>
  <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
      <collectionProp name="Arguments.arguments"/>
    </elementProp>
    <stringProp name="HTTPSampler.domain">example.com</stringProp>
    <stringProp name="HTTPSampler.port">80</stringProp>
    <stringProp name="HTTPSampler.protocol">http</stringProp>
    <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
  </ConfigTestElement>
  <hashTree/>
  <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
    <collectionProp name="CookieManager.cookies"/>
    <boolProp name="CookieManager.clearEachIteration">true</boolProp>
    <boolProp name="CookieManager.controlledByThreadGroup">true</boolProp>
  </CookieManager>
  <hashTree/>
  <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login Request" enabled="true">
    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
      <collectionProp name="Arguments.arguments">
        <elementProp name="username" elementType="HTTPArgument">
          <boolProp name="HTTPArgument.always_encode">false</boolProp>
          <stringProp name="Argument.value">[tên người dùng]</stringProp>
          <stringProp name="Argument.metadata">=</stringProp>
          <boolProp name="HTTPArgument.use_equals">true</boolProp>
          <stringProp name="Argument.name">username</stringProp>
        </elementProp>
        <elementProp name="password" elementType="HTTPArgument">
          <boolProp name="HTTPArgument.always_encode">false</boolProp>
          <stringProp name="Argument.value">[mật khẩu]</stringProp>
          <stringProp name="Argument.metadata">=</stringProp>
          <boolProp name="HTTPArgument.use_equals">true</boolProp>
          <stringProp name="Argument.name">password</stringProp>
        </elementProp>
      </collectionProp>
    </elementProp>
    <stringProp name="HTTPSampler.path">/login</stringProp>
    <stringProp name="HTTPSampler.method">POST</stringProp>
    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
    <boolProp name="HTTPSampler.monitor">false</boolProp>
  </HTTPSamplerProxy>
  <hashTree>
    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
      <collectionProp name="Asserion.test_strings">
        <stringProp name="418449460">Welcome, [tên người dùng]</stringProp>
      </collectionProp>
      <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
      <boolProp name="Assertion.assume_success">false</boolProp>
      <intProp name="Assertion.test_type">2</intProp>
    </ResponseAssertion>
    <hashTree/>
  </hashTree>
  <ViewResultsTree guiclass="ViewResultsFullVisualizer" testclass="ViewResultsFullVisualizer" testname="View Results Tree" enabled="true">
    <boolProp name="ViewResultsFullVisualizer.gui.always_on_top">false</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.update_period">500</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.graph_render">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.number_of_threads">false</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.use_group_name">false</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.bytes">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.sent_bytes">false</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.url">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.status">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.note">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.time">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.label">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.latency">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.connect">false</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.sucess">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.failure">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.error">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.threadcounts">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.hostname">false</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.samplecount">true</boolProp>
    <boolProp name="ViewResultsFullVisualizer.gui.idle_time">true</boolProp>
  </ViewResultsTree>
  <hashTree/>
</hashTree>


</jmeterTestPlan>